## Plan Result (ptl_finops_reporting - TerraformPlanApply)




<pre><code>Plan: 4 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_logic_app_workflow.finopslogicapp[0]
  * azurerm_role_assignment.finopslogicapp-la[0]
  * azurerm_role_assignment.finopslogicapp-sa[0]
  * azurerm_user_assigned_identity.finopslogicapp-mi[0]




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_logic_app_workflow.finopslogicapp[0] will be created
  + resource "azurerm_logic_app_workflow" "finopslogicapp" {
      + access_endpoint                 = (known after apply)
      + connector_endpoint_ip_addresses = (known after apply)
      + connector_outbound_ip_addresses = (known after apply)
      + enabled                         = true
      + id                              = (known after apply)
      + location                        = "uksouth"
      + name                            = "finopsdataptllogicapp"
      + resource_group_name             = "finopsdataptlrg"
      + tags                            = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/finops-reporting"
          + "businessArea" = "CFT"
          + "criticality"  = "High"
          + "environment"  = "production"
          + "startupMode"  = "always"
        }
      + workflow_endpoint_ip_addresses  = (known after apply)
      + workflow_outbound_ip_addresses  = (known after apply)
      + workflow_schema                 = "https://schema.management.azure.com/providers/Microsoft.Logic/schemas/2016-06-01/workflowdefinition.json#"
      + workflow_version                = "1.0.0.0"

      + identity {
          + identity_ids = (known after apply)
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "UserAssigned"
        }
    }

  # azurerm_role_assignment.finopslogicapp-la[0] will be created
  + resource "azurerm_role_assignment" "finopslogicapp-la" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Log Analytics Reader"
      + scope                            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/oms-automation/providers/Microsoft.OperationalInsights/workspaces/hmcts-prod"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.finopslogicapp-sa[0] will be created
  + resource "azurerm_role_assignment" "finopslogicapp-sa" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/finopsdataptlrg/providers/Microsoft.Storage/storageAccounts/finopsdataptlsa"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_user_assigned_identity.finopslogicapp-mi[0] will be created
  + resource "azurerm_user_assigned_identity" "finopslogicapp-mi" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = "uksouth"
      + name                = "finopslogicapp-ptl-mi"
      + principal_id        = (known after apply)
      + resource_group_name = "finopsdataptlrg"
      + tags                = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/finops-reporting"
          + "businessArea" = "CFT"
          + "criticality"  = "High"
          + "environment"  = "production"
          + "startupMode"  = "always"
        }
      + tenant_id           = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.
```

</details>





## :warning: Errors

* add a label ptl_finops_reporting - TerraformPlanApply/add-or-update: POST https://api.github.com/repos/hmcts/finops-reporting/issues/17/labels: 422 Validation Failed [{Resource:Label Field:name Code:invalid Message:}]
<!-- github-comment: {"Command":"plan","PRNumber":17,"Program":"tfcmt","SHA1":"","Target":"ptl_finops_reporting - TerraformPlanApply","Vars":{}} -->